#include <stdio.h>
#include <stdlib.h>

// Функція для створення точки
int* toPoint(int x, int y) {
    int* point = (int*) malloc(2 * sizeof(int)); // Виділення пам'яті для двох цілих чисел (координат)
    if (point == NULL) {
        printf("Помилка виділення пам'яті\n");
        exit(1); // Вихід з програми у разі помилки
    }
    point[0] = x; // Присвоєння значення x першому елементу
    point[1] = y; // Присвоєння значення y другому елементу
    return point; // Повертаємо вказівник на початок масиву
}

int main() {

    // Створюємо точку
    int* dot = toPoint(9, 7);

    // Виведення координат і адреси точки
    printf("\nСтворено точку з координатами x=%d y=%d з адресою=%p\n", dot[0], dot[1], (void*)dot);

    free(dot); // Звільняємо пам'ять, виділену під точку
    return 0;
}
