#include <math.h>  
#include <stdio.h> 

double f(double x, int N, int A) {
    return N * x + A;  // результат рівняння N*x + A
}

int main() {
    int n = 0; 
    double a, b, c, eps;
    int N = 14;  // Фіксоване значення N
    int A = 17;  // Фіксоване значення A

    // Перевірка на випадок N = 0
    if (N == 0) {
        if (A == 0) {
            printf("Рівняння має безліч коренів (0*x + 0 = 0).\n");
        } else {
            printf("Рівняння не має коренів (0*x + A = 0, де A != 0).\n");
        }
        return 0;  // Завершення програми
    }

    a = -100;  
    b = 100;   
    eps = 0.0000000000001;  // Точність, до якої буде знайдений корінь

    do {
        c = (a + b) / 2;  // Обчислюємо середню точку між a і b

        // Якщо знак функції в точці 'a' і 'c' різний, то корінь знаходиться між 'a' і 'c'
        if (f(c, N, A) * f(a, N, A) <= 0) 
            b = c;  
        else 
            a = c;  

        n += 1;  // Лічимо кількість ітерацій
    } while (fabs(a - b) >= eps);  // Виконуємо, доки різниця між a і b більша за eps

    printf("\nРівняння N*x + A = 0 розв'язане методом половинного ділення\n");
    printf("\nN = %d\nA = %d\n", N, A);  // Виводимо значення N і A
    printf("x = %lf\n", c);  // Виводимо знайдений корінь

    return 0; 
}
