#include <stdio.h>

    int x;
    void convert() {
        char *units[] = {"", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять"};
        char *teens[] = {"десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять"};
        char *tens[] = {"", "десять", "двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев’яносто"};
        char *hundreds[] = {"", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот"};
        printf("Введіть тризначне число: ");
        scanf("%d", &x);
        if (x < 100 || x > 999) {
            printf("неправильне число\n");
        }
         
        else {
            printf("це число: ");
            printf("%s ", hundreds[x / 100]);
            if(x%100 < 20 || x%100 > 10) {
                printf("%s", teens[x%100-10]);  }
            else { printf("%s ", tens[(x % 100) / 10]);
            printf("%s", units[x % 10]); } }
    }
int main() {
    convert(x);
    return 0;
}