#include <stdio.h>

void int_to_string(int a){
    char *hundreds[] = {"", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот"};
    char *tens[] = {"", "", "двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев'яносто"};
    char *teens[] = {"десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять"};
    char *units[] = {"", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять"};

    printf("%s ", hundreds[a / 100]);
    int remainder = a % 100;

    if(remainder >=10 && remainder < 20){
        printf("%s", teens[remainder - 10]);
    }
    else{
        printf("%s %s\n", tens[remainder / 10], units[remainder % 10]);
    }
}

int main(void){
    int a;
    printf("введіть тризначне число:");
    scanf("%d", &a);

    if(a < 100 || a >= 1000){
        printf("треба тризначне\n");
        return 0;
    }
    else{
        int_to_string(a);   
    }
    
    
    return 0;
}