#include <stdio.h>

int * h();
int * t();

int main() {
    
    printf("\nФункції\n");

    // Виклик функції t() та збереження вказівника на елемент масиву
    int * T = t();

    // Виклик функції h() та збереження вказівника на елемент двовимірного масиву
    int * H = h();

    return 0; 
}

// Функція для роботи з одновимірним масивом
int * t() {
    int T[10]; 
    int x; 

    printf("\nВведіть число (0 - 9): ");
    scanf(" %d", &x); 

    // Перевірка коректності введеного індексу
    if (x > 9 || x < 0) {
        printf("NULL\n\n"); // Виведення повідомлення, якщо індекс некоректний
        return main(); // Повторний виклик функції main() для нового вводу
    } else {
        int * p; // Оголошення вказівника
        p = &T[x]; // Прив'язка вказівника до адреси елемента масиву за введеним індексом
        printf("Вказівник на %d з масиву: %p\n\n", x, p); 
    }
    return 0; 
}

// Функція для роботи з двовимірним масивом
int * h(void) {
    int H[12][12]; // Оголошення двовимірного масиву розміром 12x12
    int b, w; // Змінні для зберігання індексів

    // Заповнення масиву H значеннями
    for (int j = 0; j < 12; ++j)
        for (int i = 0; i < 12; ++i)
            H[j][i] = (j * 10) + i; // Присвоєння значень у масив

    // Запитуємо у користувача індекси для доступу до елемента двовимірного масиву
    printf("\nВведіть індекс масиву розміром 12х12, вказівник якого ви хочете вивести:\n\n");
    printf("Перший індекс: ");
    scanf("%d", &b); // Читання першого індексу
    printf("Другий індекс: ");
    scanf("%d", &w); // Читання другого індексу

    // Перевірка коректності введених індексів
    if (b > 11 || b < 0 || w > 11 || w < 0) {
        printf("NULL"); 
    } else {
        int * p; // Оголошення вказівника
        p = &H[b][w]; // Прив'язка вказівника до адреси елемента масиву за введеними індексами
        printf("Адреса числа %d: %p\n\n\n", H[b][w], p); 
    }
    return 0; 
}
