#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main() {
    printf("\nМасив з 20 чисел:\n");

    int a[100]; 
    srand(time(NULL));

    // Цикл для заповнення масиву випадковими числами
    for (int i = 0; i < 20; i++) {
        a[i] = rand() % 100; 
        printf("%d ", a[i]); 
    }


    int min = a[0]; 
    int max = a[0]; 
    int sum = 0; 

    // Цикл для знаходження мінімального та максимального значення
    for (int v = 0; v < 20; v++) { 
        if (a[v] < min) { // Якщо поточний елемент менший за мінімум
            min = a[v]; // Оновлюємо мінімум
        }
        if (a[v] > max) { // Якщо поточний елемент більший за максимум
            max = a[v]; // Оновлюємо максимум
        }
        sum += a[v]; // Додаємо значення до суми
    }

    printf("\n\nМаксимальне число: %d\nМінімальне число: %d\nСума чисел: %d\n\n", max, min, sum);

    return 0; // Завершуємо програму
}
